app/controllers/feeds_controller.rb

SELECT * FROM "feeds"
---
  def index
    @feeds = Feed.all

SELECT * FROM "feeds" WHERE ("feeds"."id" = 1)
---
  def show
    @feed = Feed.find(params[:id])

SELECT * FROM "feeds" WHERE ("feeds"."id" = 1)
---
  def edit
    @feed = Feed.find(params[:id])

INSERT INTO "feeds" ("name", "created_at", "updated_at", "url") VALUES('Zombie Fights Shark', '2010-03-01 05:22:58', '2010-03-01 05:22:58', 'http://zombiefightsshark.blogspot.com/feeds/posts/default')
---
  def create
    @feed = Feed.new(params[:feed])

#i'd like to, here, have it write the feed url to a file
    respond_to do |format|
      if @feed.save

SELECT * FROM "feeds" WHERE ("feeds"."id" = 1)
---
  def update
    @feed = Feed.find(params[:id])