app/controllers/home_controller.rb

  def index
    @feeds = Feed.all
---
SELECT * FROM "feeds"